In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("Dataset.csv")
data

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
1  02-07-2019       1002.0     10        NaN        80.0
2  03-07-2019          NaN     10        3.0        60.0
3  06-07-2019          NaN     11        0.0         NaN
4  07-07-2019       1005.0     11        4.0         NaN
5  08-07-2019          NaN     11       10.0         NaN
6  09-07-2019       1007.0     12        4.0        80.0
7  10-07-2019       1008.0     12        NaN        90.0
8  11-07-2019       1009.0     12        NaN        60.0
9  12-07-2019       1010.0     12        6.0        85.0

In [5]:
gr1=data.groupby(by="Class")
gr1.groups

{10: [0, 1, 2], 11: [3, 4, 5], 12: [6, 7, 8, 9]}

In [6]:
gr2=data.groupby(["Class","Study Hrs"])
gr2.groups

{(10, 2.0): [0], (10, nan): [1], (10, 3.0): [2], (11, 0.0): [3], (11, 4.0): [4], (11, 10.0): [5], (12, 4.0): [6], (12, nan): [7], (12, nan): [8], (12, 6.0): [9]}

In [8]:
gr3=data.groupby(by="Class").get_group(10)
gr3

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
1  02-07-2019       1002.0     10        NaN        80.0
2  03-07-2019          NaN     10        3.0        60.0

In [9]:
gr3.sum()

Date           01-07-201902-07-201903-07-2019
Student ID                               2003
Class                                      30
Study Hrs                                   5
Percentege                                190
dtype: object

In [10]:
gr3.mean()

Student ID     1001.500000
Class            10.000000
Study Hrs         2.500000
Percentege       63.333333
dtype: float64

In [11]:
gr3.describe()

       Student ID   Class  Study Hrs  Percentege
count     2.000000    3.0   2.000000    3.000000
mean   1001.500000   10.0   2.500000   63.333333
std       0.707107    0.0   0.707107   15.275252
min    1001.000000   10.0   2.000000   50.000000
25%    1001.250000   10.0   2.250000   55.000000
50%    1001.500000   10.0   2.500000   60.000000
75%    1001.750000   10.0   2.750000   70.000000
max    1002.000000   10.0   3.000000   80.000000

In [12]:
gr3.agg(["sum","max","mean"])

,Date,Student ID,Class,Study Hrs,Percentege
sum,01-07-201902-07-201903-07-2019,2003.0,30.0,5.0,190.000000
max,03-07-2019,1002.0,10.0,3.0,80.000000
mean,NaN,1001.5,10.0,2.5,63.333333